{
  "curriculum": "curriculo-rodrigo-goulart-01-2026.pdf",
  "portfolio_repo_url": "https://github.com/RodrigoDGoulart/portfolio",
  "contacts": {
    "whatsapp": "",
    "whatsapp_label": "",
    "linkedin": "rodrigo-diniz-goulart",
    "github": "RodrigoDGoulart",
    "email": "rodinizgoulart@gmail.com"
  },
  "pretitle": "Olá! Me chamo...",
  "title": "Rodrigo Goulart",
  "subtitle_prefix": "Desenvolvedor ",
  "subtitles": [
    {
      "name": "Front-end",
      "color": "#52CBFF"
    },
    {
      "name": "Back-end",
      "color": "#E252FF"
    },
    {
      "name": "Fullstack",
      "color": "#52FF77"
    },
    {
      "name": "React",
      "color": "#52CBFF"
    },
    {
      "name": "Vue",
      "color": "#52FF77"
    },
    {
      "name": "React Native",
      "color": "#7C7EFF"
    },
    {
      "name": "Laravel",
      "color": "#FF4545"
    },
    {
      "name": "TypeScript",
      "color": "#7C7EFF"
    },
    {
      "name": "PHP",
      "color": "#7C7EFF"
    },
    {
      "name": "Python",
      "color": "#52CBFF"
    }
  ],
  "description": "Apaixonado por <b>tecnologia e design</b> e experiente em múltiplos projetos com foco em <b>design, usabilidade e experiência do usuário</b>, unindo funcionalidade e estética. Nos meios em que atuo, sempre sou <b>reconhecido pela criatividade e comprometimento</b>, entregando o melhor de mim.",
  "about_me": "Eu comecei minha trajetória como designer gráfico, o que me deu uma <b>base sólida em estética, usabilidade e atenção aos detalhes.</b> Foi durante minha formação em <b>Análise e Desenvolvimento de Sistemas pela Fatec</b> que uni essa afinidade com design ao desenvolvimento de software, direcionando meu foco principalmente para o front-end. Desde então, <b>atuo no desenvolvimento de aplicações web e mobile, trabalhando com tecnologias como Laravel, Vue.js, React, Node.js e soluções mobile</b>, sempre participando ativamente do ciclo completo de desenvolvimento.\nAtualmente tenho grande interesse em entender como as coisas funcionam de ponta a ponta, o que me leva a explorar não apenas desenvolvimento de software, mas também áreas como inteligência artificial e eletrônica. Essa postura investigativa reflete diretamente na minha atuação profissional: <b>busco compreender o contexto do projeto, o objetivo do produto e o perfil do usuário antes de implementar soluções.</b> Isso me permite entregar funcionalidades mais completas, correções de bugs mais consistentes e sistemas mais robustos a longo prazo. <b>Atualmente atuo como desenvolvedor mobile pleno</b>, expandindo continuamente meus conhecimentos técnicos e contribuindo também com versionamento, organização de branches e gestão técnica das aplicações.",
  "jobs": [
    {
      "title": "Desenvolvedor Mobile/Front-end",
      "subtitle": "Tria Software (Outubro/2025 - Atual)",
      "desc": "- Participação no time de desenvolvimento de aplicação mobile de gestão de conflitos com tecnologia GIS;\n- Responsável pela arquitetura front-end, implementação de novas funcionalidades, versionamento e entregas de sprint;\n- Colaboração com demais times de desenvolvimento, visando garantir consistência UX/UI e entregas de alta qualidade;\n- Manutenção, otimização e evolução da aplicação principal;",
      "badges": [
        "react-native",
        "react",
        "arcgis",
        "android",
        "azure-devops"
      ]
    },
    {
      "title": "Desenvolvedor Full Stack",
      "subtitle": "Boostech (Março/2025 - Outubro/2025)",
      "desc": "- Participação ativa no desenvolvimento e evolução de aplicação web YMS utilizando Laravel e Vue, entregando constantes melhorias de usabilidade, performance e escalabilidade;\n- Implementação e desenvolvimento de aplicação android com React Native/Expo, integrando funções nativas e expandindo e aumentando a qualidade da aplicação;\n- Entrega de funcionalidades de alto impacto, alinhado com boas práticas de experiência do usuário e arquitetura de software;\n- Definição e aplicação de boas práticas de desenvolvimento com o time, incluindo Clean Code, Conventional Commits e melhorias do controle de versão e workflow;",
      "badges": [
        "php",
        "laravel",
        "javascript",
        "vue",
        "react-native",
        "android"
      ]
    },
    {
      "title": "Desenvolvedor Front-end/GIS",
      "subtitle": "Imagem (Setembro/2022 - Março/2025)",
      "desc": "- Desenvolvimento de aplicações interativas focado em GIS com React, Typescript, ArcGIS API e ArcGIS Experience Builder;\n- Criação de scripts Python para automação de workflow e processamento de dados geoespaciais;\n- Paritipação de consultorias técnicas para mapeamento e desenvolvimento de aplicações nativas ArcGIS, dando suporte à clientes desde o design até a implementação de soluções GIS;",
      "badges": [
        "arcgis",
        "python",
        "react",
        "typescript"
      ]
    }
  ],
  "stacks": [
    {
      "name": "Linguagens",
      "badges": [
        "python",
        "javascript",
        "typescript",
        "java",
        "php"
      ]
    },
    {
      "name": "Front-end",
      "badges": [
        "react",
        "react-native",
        "next",
        "vue",
        "angular",
        "sass",
        "material-ui",
        "vuetify",
        "tailwind-css",
        "android"
      ]
    },
    {
      "name": "Back-end",
      "badges": [
        "node",
        "flask",
        "django",
        "laravel",
        "spring"
      ]
    },
    {
      "name": "Banco de dados",
      "badges": [
        "mysql",
        "postgre",
        "mongodb"
      ]
    },
    {
      "name": "Extras",
      "badges": [
        "arcgis",
        "git",
        "github",
        "azure-devops",
        "jira",
        "vercel",
        "renderer",
        "figma",
        "open-ai",
        "ollama",
        "firebase"
      ]
    }
  ],
  "projects": [
    {
      "imgs": [
        "images/project_imgs/yardex/thumbnail.png"
      ],
      "title": "Yardex",
      "subtitle": "Gestão de Pátio Inteligente - Boostech [2025]",
      "badges": [
        "laravel",
        "postgre",
        "vue",
        "react-native",
        "php",
        "javascript",
        "android"
      ],
      "desc": "<b>Yardex</b> é uma aplicação voltada para a gestão de pátios de veículos, com foco no controle operacional de recebimento e envio de cargas. <b>O sistema contempla funcionalidades como emissão de relatórios, integração com APIs externas, dashboards gerenciais e um aplicativo mobile</b> utilizado por operários durante as atividades em campo. <b>O projeto é de autoria e propriedade da Boostech</b>, onde atuei ativamente no desenvolvimento de novas funcionalidades, além de ajustes e correções de bugs, contribuindo para a evolução, estabilidade e melhoria contínua da solução.",
      "details": "Minha atuação no projeto esteve diretamente ligada à evolução contínua da solução, atendendo demandas estratégicas do cliente e aprimorando a experiência de uso do sistema. <b>Essas contribuições resultaram em maior satisfação do cliente, além de fortalecer a confiança na plataforma e impulsionar a adesão de novas unidades e filiais ao projeto.</b>\nPrincipais atuações no projeto:\n- Implementação de novas funcionalidades solicitadas pelo cliente, alinhadas às necessidades operacionais do pátio.\n- Otimização de performance em interfaces Kanban, listagens e scripts de carga de dados.\n- Ajustes e melhorias de interface com foco em boas práticas de usabilidade e experiência do usuário (UX).\n- Desenvolvimento de aplicativo mobile nativo integrado à aplicação web, incluindo funcionalidades exclusivas para uso em campo.\n- Atuação técnica em conjunto com desenvolvedor júnior, promovendo tutoria, compartilhamento de boas práticas e suporte na implementação de novas funcionalidades.\n- Colaboração contínua com o time de desenvolvimento para adoção de novas práticas no código e atuação alinhada ao fluxo de sprints.",
      "links": [
        {
          "name": "Yardex",
          "url": "https://yardex.com.br/"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/cetesb-qual-ar/mockup.png",
        "images/project_imgs/cetesb-qual-ar/interface.png",
        "images/project_imgs/cetesb-qual-ar/mobile-ui.png"
      ],
      "title": "Mapa de Qualidade do Ar - CETESB",
      "subtitle": "Imagem Geosistemas [2024]",
      "badges": [
        "arcgis",
        "react",
        "javascript"
      ],
      "desc": "O <b>Mapa de Qualidade do Ar</b> é uma aplicação desenvolvida para a <b>CETESB</b> como uma segunda versão de uma solução já existente, originalmente mais básica. <b>Durante minha atuação na Imagem Geosistemas, participei ativamente do desenvolvimento e melhoria dessa nova versão da aplicação, construída com a plataforma ArcGIS.</b> O projeto tem como foco a visualização geográfica do estado de São Paulo, exibindo a localização dos postos de monitoramento da qualidade do ar e permitindo ao usuário consultar, de forma interativa, a qualidade do ar por região, recomendações associadas e a concentração dos diferentes poluentes monitorados. <b>O desenvolvimento ocorreu durante o período de alta de poluentes no segundo semestre de 2024, reforçando a importância do projeto como ferramenta de informação pública e conscientização ambiental.</b>",
      "details": "Minha atuação no projeto esteve concentrada na <b>evolução e finalização da aplicação, contribuindo diretamente para alinhar a solução às expectativas da CETESB e acelerar a entrega do projeto com maior qualidade.</b> A partir de uma compreensão mais aprofundada das necessidades do cliente, foi possível direcionar decisões técnicas e de design de forma mais assertiva, resultando em uma <b>evolução mais rápida, consistente e alinhada ao uso real da aplicação.</b>\nPrincipais atuações no projeto:\n- Participação em reunião presencial com o time da CETESB para entendimento aprofundado das necessidades, expectativas e desafios do projeto.\n- Discussão e validação de decisões de design e funcionalidades, com apresentação de protótipos para direcionar a evolução da aplicação.\n- Ajustes de interface seguindo boas práticas de experiência do usuário (UX) e usabilidade, visando maior clareza e facilidade de uso.\n- Otimização de performance da aplicação para garantir melhor resposta na visualização e interação com o mapa.\n- Implementação de funcionalidades customizadas dentro da plataforma ArcGIS, atendendo demandas específicas do cliente.\n- Desenvolvimento da versão responsiva e otimizada para uso em dispositivos móveis.",
      "links": [
        {
          "name": "Aplicativo",
          "url": "https://arcgis.cetesb.sp.gov.br/portal/apps/experiencebuilder/experience/?id=13582bb92885456fb9f10ee84ad1507e&page=Classifica%C3%A7%C3%A3o-Atual&views=Indicadores-24h"
        },
        {
          "name": "Apresentação",
          "url": "https://www.youtube.com/watch?v=THwxEW83pGA"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/projeto-ia-altave/thumbnail.png",
        "images/project_imgs/projeto-ia-altave/dashboard-ui.png",
        "images/project_imgs/projeto-ia-altave/areas-ui.png",
        "images/project_imgs/projeto-ia-altave/ai-running-prt.png"
      ],
      "title": "Projeto IA - Altave",
      "subtitle": "FATEC - Projeto acadêmico [2024]",
      "badges": [
        "vue",
        "spring",
        "flask",
        "mysql",
        "yolo",
        "vuetify",
        "typescript",
        "java",
        "python"
      ],
      "desc": "O <b>Projeto IA</b> é uma plataforma desenvolvida em parceria acadêmica com a <b>Altave</b> durante o curso de Análise e Desenvolvimento de Sistemas na FATEC, com foco no <b>monitoramento inteligente de áreas restritas (redzones)</b> por meio de visão computacional. A solução foi projetada para cenários como <b>embarcações e edifícios corporativos</b>, onde o sistema identifica e contabiliza automaticamente entradas e saídas de pessoas em áreas sensíveis, reforçando a segurança operacional.\nA arquitetura do projeto é composta por três camadas integradas: <b>módulo de Inteligência Artificial, back-end e front-end</b>, onde elas são responsáveis respectivamente pela análise contínua de vídeo, processamento das regras de negócio e visualização dos dados em tempo real, incluindo dashboards analíticos, relatórios e módulos administrativos. O projeto marcou o encerramento da formação acadêmica na FATEC, consolidando conhecimentos técnicos em um sistema completo e de alta complexidade, próximo a contextos reais da indústria.",
      "details": "Minha atuação no projeto esteve concentrada no <b>desenvolvimento completo do front-end da aplicação</b>, abrangendo desde a definição dos fluxos de navegação e arquitetura de componentes até a implementação final das interfaces em produção. Durante o projeto, tive meu primeiro contato com o framework Vue, aplicando práticas modernas de componentização aprendidas previamente com React, além da utilização de bibliotecas como o Vuetify para acelerar a construção de interfaces robustas, acessíveis e consistentes.\nAs interfaces desenvolvidas foram responsáveis por operacionalizar módulos centrais da plataforma, como <b>dashboard em tempo real, listagens de registros de entrada e saída, geração de relatórios, cadastros de usuários, áreas e redzones</b>, elementos essenciais para a rotina das equipes de segurança descritos no manual do sistema. Minha participação destacou-se pela <b>qualidade visual, experiência do usuário e performance</b>, além do envolvimento direto nas tomadas de decisão técnicas e funcionais do projeto.\nPrincipais atuações no projeto:\n- Desenvolvimento da arquitetura de front-end em Vue com foco em componentização, reutilização e escalabilidade.\n- Implementação das interfaces administrativas e operacionais utilizando Vuetify.\n- Construção do dashboard com indicadores em tempo real e tabelas de auditoria de acessos.\n- Desenvolvimento de fluxos para download de relatórios e visualização histórica dos eventos.\n- Otimização de performance e fluidez das telas em cenários com grande volume de dados.\n- Participação ativa na definição de funcionalidades e priorização das entregas junto ao time.\n- Colaboração constante com as equipes de backend e IA para alinhamento das integrações.\n- Reconhecimento como desenvolvedor de destaque pela qualidade das interfaces e impacto direto na usabilidade da plataforma.",
      "links": [
        {
          "name": "Repositório",
          "url": "https://github.com/CodeLabFatec/ProjetoIA"
        },
        {
          "name": "Manual do usuário",
          "url": "https://github.com/CodeLabFatec/ProjetoIA/blob/main/docs/MANUAL%20DO%20USU%C3%81RIO.pdf"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/fcmanager/thumbnail.png",
        "images/project_imgs/fcmanager/home-ui.png",
        "images/project_imgs/fcmanager/list-ui.png"
      ],
      "title": "FCManager - Imagem Geosistemas",
      "subtitle": "FATEC - Projeto acadêmico [2023]",
      "badges": [
        "react-native",
        "node",
        "mongodb",
        "android",
        "typescript"
      ],
      "desc": "O <b>FCManager (Field Crew Manager)</b> é um aplicativo voltado ao gerenciamento de equipamentos e atividades de campo, desenvolvido em parceria acadêmica com a <b>Imagem Geosistemas</b> durante o curso de Análise e Desenvolvimento de Sistemas na FATEC. A solução foi concebida como um sistema mobile nativo para uso em campo, oferecendo funcionalidades de <b>geolocalização de equipamentos via API de mapas, suporte offline com sincronização de dados e gestão completa de cadastros</b>. O aplicativo também contempla controle de acessos, com permissões diferenciadas para usuários administrativos e operacionais, garantindo segurança e organização no uso das funcionalidades. O projeto foi planejado e executado com base na metodologia ágil SCRUM, com entregas organizadas em sprints que cobriram desde as funções básicas de cadastro e listagem até mapas interativos, filtros de distância e suporte offline, compondo uma solução robusta para operações de campo sob diferentes condições de conectividade.",
      "details": "No FCManager, atuei como <b>Scrum Master e responsável técnico por praticamente todas as etapas do projeto</b>, incluindo desenvolvimento das interfaces mobile e backend, coordenação das sprints, organização do backlog e condução das entregas e apresentações. Essa experiência consolidou minha capacidade de liderança, priorização de tarefas e tomada de decisões alinhadas aos objetivos do cliente e da equipe, além de reforçar minha experiência full stack em um contexto real de desenvolvimento ágil. Minha contribuição impactou diretamente a qualidade técnica e a evolução das funcionalidades da aplicação, destacando-se pela integração entre front-end, lógica offline, mapas e gestão de usuários administrativos. Abaixo estão as principais contribuições:\nPrincipais atuações no projeto:\n- Liderança como Scrum Master, facilitando organização das sprints, definição de histórias, planejamento e apresentação dos resultados ao cliente e à banca.\n- Desenvolvimento de toda a solução mobile em React Native, garantindo interfaces nativas de alta performance e fluidez para operações em campo.\n- Implementação do backend em TypeScript com Node.js e MongoDB, incluindo autenticação, controle de usuários e regras de negócios como manobras e gerenciamento de equipamentos.\n- Integração com APIs de mapas para visualização e seleção geográfica de equipamentos e manobras, além de filtros por distância máxima.\n- Suporte offline com sincronização de dados através de filas de cadastro e atualização, assegurando continuidade de uso sem conexão à internet.\n- Criação de telas administrativas para configurações, como limites máximos de manobras ativas por usuário e filtros padrão na listagem de itens.\n- Estruturação de fluxos de autenticação seguros, incluindo bloqueio de sessão ao minimizar e retomar o app.\n- Participação ativa nas decisões de design, arquitetura e priorização de funcionalidades junto à equipe, contribuindo para o alinhamento técnico e experiência do usuário.",
      "links": [
        {
          "name": "Repositório",
          "url": "https://github.com/RodrigoDGoulart/field-crew-manager"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/ionic-deploy-manager-thumbnail.png"
      ],
      "title": "Deploy Manager - IONIC",
      "subtitle": "FATEC - Projeto acadêmico [2023]",
      "badges": [
        "react",
        "typescript",
        "node",
        "mysql",
        "sass",
        "docker"
      ],
      "desc": "O <b>Deploy Manager</b> (também referenciado no repositório como <b>IONIC Deploy Manager</b>) é uma aplicação web desenvolvida em parceria acadêmica com a <b>IONIC Health</b> durante o curso de Análise e Desenvolvimento de Sistemas na FATEC, com o propósito de <b>organizar e gerir o fluxo de chamados internos da empresa</b>. A solução foi projetada para estruturar a criação de tickets, avaliação das solicitações e acompanhamento do progresso das atividades de implementação ou correção de erros em projetos, centrando-se em uma experiência de uso clara e eficiente. A aplicação foi construída utilizando uma stack moderna com <b>React e TypeScript no front-end</b> e <b>Node.js com TypeScript no back-end</b>, apoiada por um processo de desenvolvimento ágil baseado na metodologia SCRUM, com entregas iterativas planejadas em sprints de evolução contínua ao longo do projeto.",
      "details": "Minha atuação no projeto incluiu a <b>função de Scrum Master</b>, bem como o desenvolvimento principal do <b>front-end e da prototipação das interfaces</b>, além de participar ativamente do planejamento e gestão das sprints. Trabalhei diretamente na definição de fluxos, organização do backlog, priorização das entregas, além de implementar funcionalidades fundamentais para a solução final. A experiência fortaleceu minhas habilidades de liderança técnica e coordenação de times, assim como minha proximidade com o desenvolvimento full stack em um contexto real de projeto integrado. \nPrincipais atuações no projeto:\n- Condução e organização das sprints como Scrum Master, incluindo definição de histórias, planejamento das entregas e apresentações de resultados ao cliente e à banca acadêmica.\n- Prototipação e desenvolvimento das interfaces em React + TypeScript, com foco em usabilidade e desempenho.\n- Implementação de telas de criação e gerenciamento de chamados, filtros de status, detalhes de atividade e dashboards de acompanhamento.\n- Integração com o backend Node.js + TypeScript para consumo das APIs de criação, atualização e consulta de tickets.\n- Atuação em decisões de design, arquitetura e priorização técnica junto à equipe, alinhando expectativas do cliente às entregas planejadas.\n- Suporte no processo de implantação das versões entregues e garantias de consistência entre protótipos e produto final.",
      "links": [
        {
          "name": "Repositório",
          "url": "https://github.com/meta-build/Projeto-IONIC-Health"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/embraer-old-thumbnail.png"
      ],
      "title": "Operational Landing Distance - EMBRAER",
      "subtitle": "FATEC - Projeto acadêmico [2022]",
      "badges": [
        "react",
        "typescript",
        "node",
        "mysql",
        "bootstrap",
        "figma"
      ],
      "desc": "<b>Operational Landing Distance</b> é uma aplicação desenvolvida em parceria acadêmica com a <b>EMBRAER</b> durante o curso de Análise e Desenvolvimento de Sistemas na FATEC, com o objetivo de criar uma calculadora de distância de pouso para aeronaves. A solução considera múltiplas variáveis operacionais, incluindo <b>condições ambientais do aeroporto, fatores meteorológicos e características da aeronave</b>, como modelo, porte e configurações específicas, permitindo simular cenários reais utilizados no planejamento aeronáutico. <b>O projeto foi realizado no segundo semestre do curso como parte de uma iniciativa prática orientada a problemas reais da indústria</b>, aproximando os alunos de desafios técnicos encontrados no setor aeronáutico.",
      "details": "Minha atuação no projeto esteve focada no <b>desenvolvimento completo das interfaces da aplicação, desde a fase de concepção e prototipagem até a implementação final em produção</b>. O projeto teve papel fundamental no meu amadurecimento técnico, representando meu primeiro contato prático com arquiteturas de aplicações do tipo SPA, componentização de interfaces e adoção de boas práticas de experiência do usuário (UX), além de fortalecer minha capacidade de entrega em ciclos ágeis.\nPrincipais atuações no projeto:\n- Idealização e prototipagem das telas e fluxos de navegação da aplicação, considerando clareza, usabilidade e organização das informações.\n- Desenvolvimento das interfaces finais em ambiente de produção, garantindo consistência visual e boa experiência de uso.\n- Primeiro contato prático com arquitetura SPA e componentização, aplicando conceitos modernos de front-end.\n- Evolução das boas práticas de interface e experiência do usuário ao longo das sprints do projeto.\n- Participação ativa nas quatro sprints do desenvolvimento, contribuindo diretamente para as entregas planejadas.\n- Atuação como um dos desenvolvedores de destaque do time, auxiliando na organização das tarefas e na sustentação do ritmo de entrega da equipe.",
      "links": [
        {
          "name": "Repositório",
          "url": "https://github.com/meta-build/Projeto-Embraer"
        }
      ]
    }
  ]
}