{
  "curriculum": "rodrigo-goulart-curriculum-2025-12.pdf",
  "portfolio_repo_url": "https://github.com/RodrigoDGoulart/portfolio",
  "contacts": {
    "whatsapp": "5512996626277",
    "whatsapp_label": "+55 (12) 99662-6277",
    "linkedin": "/rodrigo-diniz-goulart",
    "github": "RodrigoDGoulart",
    "email": "rodinizgoulart@gmail.com"
  },
  "title": "Rodrigo Goulart",
  "subtitles": [
    {
      "name": "Front-end",
      "color": "#52CBFF"
    },
    {
      "name": "Back-end",
      "color": "#E252FF"
    },
    {
      "name": "Fullstack",
      "color": "#52FF77"
    },
    {
      "name": "React",
      "color": "#52CBFF"
    },
    {
      "name": "Vue",
      "color": "#52FF77"
    },
    {
      "name": "React Native",
      "color": "#7C7EFF"
    },
    {
      "name": "Laravel",
      "color": "#FF4545"
    },
    {
      "name": "TypeScript",
      "color": "#7C7EFF"
    },
    {
      "name": "PHP",
      "color": "#7C7EFF"
    },
    {
      "name": "Python",
      "color": "#52CBFF"
    }
  ],
  "description": "Passionate about <b>technology, design</b> and experienced in multiple projects focused on <b>design, usability, and user experience</b>, combining functionality and aesthetics. In the environments where I work, I am always <b>recognized for creativity and commitment</b>, delivering the best of myself.",
  "about_me": "I began my journey as a graphic designer, which gave me a <b>strong foundation in aesthetics, usability, and attention to detail.</b> It was during my degree in <b>Systems Analysis and Development at Fatec</b> that I combined this affinity for design with software development, focusing mainly on front-end development. Since then, <b>I have been working on web and mobile applications, using technologies such as Laravel, Vue.js, React, Node.js, and mobile solutions</b>, always actively participating in the entire development lifecycle.\nCurrently, I have a strong interest in understanding how things work end to end, which leads me to explore not only software development but also areas such as artificial intelligence and electronics. This investigative mindset is directly reflected in my professional approach: <b>I strive to understand the project context, the product's goals, and the user profile before implementing solutions.</b> This allows me to deliver more complete features, more consistent bug fixes, and more robust systems in the long term. <b>I currently work as a mid-level mobile developer</b>, continuously expanding my technical knowledge and also contributing to version control, branch organization, and the technical management of applications.",
  "jobs": [
    {
      "title": "Mobile/Front-end Developer",
      "subtitle": "Tria Software (October/2025 - Present)",
      "desc": "- Participation in the development team of a mobile application for conflict management using GIS technology;\n- Responsible for front-end architecture, implementation of new features, versioning, and sprint deliveries;\n- Collaboration with other development teams to ensure UX/UI consistency and high-quality deliveries;\n- Maintenance, optimization, and evolution of the main application;",
      "badges": [
        "react-native",
        "react",
        "arcgis",
        "android",
        "azure-devops"
      ]
    },
    {
      "title": "Full Stack Developer",
      "subtitle": "Boostech (March/2025 - October/2025)",
      "desc": "- Active participation in the development and evolution of a YMS web application using Laravel and Vue, delivering continuous improvements in usability, performance, and scalability;\n- Implementation and development of an Android application with React Native/Expo, integrating native features and expanding and improving application quality;\n- Delivery of high-impact features aligned with best practices in user experience and software architecture;\n- Definition and application of development best practices with the team, including Clean Code, Conventional Commits, and improvements to version control and workflow;",
      "badges": [
        "php",
        "laravel",
        "javascript",
        "vue",
        "react-native",
        "android"
      ]
    },
    {
      "title": "Front-end/GIS Developer",
      "subtitle": "Imagem (September/2022 - March/2025)",
      "desc": "- Development of interactive GIS-focused applications using React, TypeScript, ArcGIS API, and ArcGIS Experience Builder;\n- Creation of Python scripts for workflow automation and geospatial data processing;\n- Participation in technical consulting for mapping and development of native ArcGIS applications, supporting clients from design to the implementation of GIS solutions;",
      "badges": [
        "arcgis",
        "python",
        "react",
        "typescript"
      ]
    }
  ],
  "stacks": [
    {
      "name": "Languages",
      "badges": [
        "python",
        "javascript",
        "typescript",
        "java",
        "php"
      ]
    },
    {
      "name": "Front-end",
      "badges": [
        "react",
        "react-native",
        "next",
        "vue",
        "angular",
        "sass",
        "material-ui",
        "vuetify",
        "tailwind-css",
        "android"
      ]
    },
    {
      "name": "Back-end",
      "badges": [
        "node",
        "flask",
        "django",
        "laravel",
        "spring"
      ]
    },
    {
      "name": "Databases",
      "badges": [
        "mysql",
        "postgre",
        "mongodb"
      ]
    },
    {
      "name": "Extras",
      "badges": [
        "arcgis",
        "git",
        "github",
        "azure-devops",
        "jira",
        "vercel",
        "renderer",
        "figma",
        "open-ai",
        "ollama",
        "firebase"
      ]
    }
  ],
  "projects": [
    {
      "imgs": [
        "images/project_imgs/yardex/thumbnail.png"
      ],
      "title": "Yardex",
      "subtitle": "Intelligent Yard Management - Boostech [2025]",
      "badges": [
        "laravel",
        "postgre",
        "vue",
        "react-native",
        "php",
        "javascript",
        "android"
      ],
      "desc": "<b>Yardex</b> is an application designed for vehicle yard management, focusing on operational control of cargo receiving and dispatching. <b>The system includes features such as report generation, integration with external APIs, management dashboards, and a mobile application</b> used by operators during field activities. <b>The project is authored and owned by Boostech company</b>, where I actively worked on the development of new features, as well as bug fixes and improvements, contributing to the solution’s evolution, stability, and continuous enhancement.",
      "details": "My role in the project was directly tied to the continuous evolution of the solution, addressing strategic client demands and improving the system’s user experience. <b>These contributions resulted in higher client satisfaction, strengthened trust in the platform, and encouraged adoption by new units and branches.</b>\nMain contributions to the project:\n- Implementation of new client-requested features aligned with yard operational needs.\n- Performance optimization in Kanban interfaces, listings, and data-loading scripts.\n- Interface adjustments and improvements focused on usability best practices and user experience (UX).\n- Development of a native mobile application integrated with the web platform, including exclusive field-use features.\n- Technical collaboration with a junior developer, providing mentoring, best-practice sharing, and implementation support.\n- Ongoing collaboration with the development team to adopt new coding practices and maintain alignment with sprint workflows.",
      "links": [
        {
          "name": "Yardex",
          "url": "https://yardex.com.br/"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/cetesb-qual-ar/mockup.png",
        "images/project_imgs/cetesb-qual-ar/interface.png",
        "images/project_imgs/cetesb-qual-ar/mobile-ui.png"
      ],
      "title": "Air Quality Map - CETESB",
      "subtitle": "Imagem Geosistemas [2024]",
      "badges": [
        "arcgis",
        "react",
        "javascript"
      ],
      "desc": "The <b>Air Quality Map</b> is an application developed for <b>CETESB</b> as a second version of an existing solution that was originally more basic. <b>During my time at Imagem Geosistemas, I actively participated in the development and enhancement of this new version, built using the ArcGIS platform.</b> The project focuses on geographic visualization of the state of São Paulo, displaying monitoring station locations and allowing users to interactively consult regional air quality, associated recommendations, and pollutant concentration levels. <b>The development took place during a period of high pollution levels in the second half of 2024 in São Paulo, Brazil, reinforcing the project’s importance as a public information and environmental awareness tool.</b>",
      "details": "My work on the project focused on the <b>evolution and finalization of the application, directly helping align the solution with CETESB’s expectations and accelerating delivery with higher quality.</b> By gaining a deeper understanding of client needs, technical and design decisions were guided more assertively, resulting in a <b>faster, more consistent evolution aligned with real-world usage.</b>\nMain contributions to the project:\n- Participation in on-site meetings with the CETESB team to deeply understand project needs, expectations, and challenges.\n- Discussion and validation of design decisions and features, including prototype presentations to guide application evolution.\n- Interface adjustments following UX and usability best practices to improve clarity and ease of use.\n- Application performance optimization to ensure smoother map interaction and visualization.\n- Implementation of customized features within the ArcGIS platform to meet specific client demands.\n- Development of a responsive version optimized for mobile devices.",
      "links": [
        {
          "name": "Application",
          "url": "https://arcgis.cetesb.sp.gov.br/portal/apps/experiencebuilder/experience/?id=13582bb92885456fb9f10ee84ad1507e&page=Classifica%C3%A7%C3%A3o-Atual&views=Indicadores-24h"
        },
        {
          "name": "Presentation (in brazilian portuguese)",
          "url": "https://www.youtube.com/watch?v=THwxEW83pGA"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/projeto-ia-altave/thumbnail.png",
        "images/project_imgs/projeto-ia-altave/dashboard-ui.png",
        "images/project_imgs/projeto-ia-altave/areas-ui.png",
        "images/project_imgs/projeto-ia-altave/ai-running-prt.png"
      ],
      "title": "AI Project - Altave",
      "subtitle": "FATEC - Academic Project [2024]",
      "badges": [
        "vue",
        "spring",
        "flask",
        "mysql",
        "yolo",
        "vuetify",
        "typescript",
        "java",
        "python"
      ],
      "desc": "The <b>AI Project</b> is a platform developed through an academic partnership with <b>Altave</b> during the Systems Analysis and Development program at FATEC, focusing on <b>intelligent monitoring of restricted areas (redzones)</b> using computer vision. The solution was designed for scenarios such as <b>vessels and corporate buildings</b>, where the system automatically identifies and counts people entering and leaving sensitive areas, reinforcing operational security.\nThe project architecture is composed of three integrated layers — <b>Artificial Intelligence module, back-end, and front-end</b> — responsible respectively for continuous video analysis, business-rule processing, and real-time data visualization, including analytical dashboards, reports, and administrative modules. The project marked the conclusion of my academic program at FATEC, consolidating technical knowledge in a complete, high-complexity system close to real industrial contexts.",
      "details": "My role in the project focused on the <b>full development of the application’s front-end</b>, from navigation-flow definition and component architecture to final production implementation. During the project, I had my first experience with the Vue framework, applying modern componentization practices previously learned with React, alongside the use of libraries such as Vuetify to accelerate the creation of robust, accessible, and consistent interfaces.\nThe interfaces delivered supported core modules of the platform such as <b>real-time dashboards, entry/exit logs, report generation, user management, areas, and redzones</b>. My contribution stood out for <b>visual quality, user experience, and performance</b>, as well as active involvement in technical and functional decision-making.\nMain contributions to the project:\n- Development of the front-end architecture in Vue with a focus on scalability and reuse.\n- Implementation of administrative and operational interfaces using Vuetify.\n- Construction of dashboards with real-time indicators and audit tables.\n- Development of flows for report downloads and historical event visualization.\n- Performance optimization for high-data-volume scenarios.\n- Active participation in feature definition and delivery prioritization.\n- Close collaboration with backend and AI teams to align integrations.\n- Recognition as a standout developer for interface quality and usability impact.",
      "links": [
        {
          "name": "Repository",
          "url": "https://github.com/CodeLabFatec/ProjetoIA"
        },
        {
          "name": "User Manual (in brazilian portuguese)",
          "url": "https://github.com/CodeLabFatec/ProjetoIA/blob/main/docs/MANUAL%20DO%20USU%C3%81RIO.pdf"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/fcmanager/thumbnail.png",
        "images/project_imgs/fcmanager/home-ui.png",
        "images/project_imgs/fcmanager/list-ui.png"
      ],
      "title": "FCManager",
      "subtitle": "FATEC - Academic Project [2023]",
      "badges": [
        "react-native",
        "node",
        "mongodb",
        "android",
        "typescript"
      ],
      "desc": "<b>FCManager (Field Crew Manager)</b> is an application focused on managing field equipment and activities, developed through an academic partnership with <b>Imagem Geosistemas</b> during the Systems Analysis and Development program at FATEC. The solution was designed as a native mobile system for field operations, offering <b>equipment geolocation via map APIs, offline support with data synchronization, and full registry management</b>. The application also includes access control with distinct permissions for administrative and operational users, ensuring security and structured use of the platform. The project was planned and executed using the agile SCRUM methodology, with sprint-based deliveries covering everything from basic registration and listing features to interactive maps, distance filters, and offline support—resulting in a robust solution for field operations under varying connectivity conditions.",
      "details": "In FCManager, I worked as <b>Scrum Master and the primary technical contributor across most stages of the project</b>, including mobile interface development, backend implementation, sprint coordination, backlog organization, and delivery/presentation management. This experience strengthened my leadership, task prioritization, and decision-making aligned with both client objectives and team delivery, while also reinforcing my full-stack experience in a real agile development context. My contributions directly impacted the technical quality and feature evolution of the application, particularly through the integration between front-end, offline logic, maps, and administrative user management. Below are the main contributions:\nMain contributions to the project:\n- Leadership as Scrum Master, facilitating sprint organization, story definition, planning, and presenting results to stakeholders and the academic board.\n- Development of the entire mobile solution in React Native, ensuring high-performance, fluid native interfaces for field operations.\n- Implementation of the backend using TypeScript with Node.js and MongoDB, including authentication, user management, and business rules such as maneuvers and equipment handling.\n- Integration with map APIs for visualization and geographic selection of equipment and maneuvers, including maximum-distance filtering.\n- Offline support with data synchronization through create/update queues, ensuring usability without an internet connection.\n- Creation of administrative configuration screens, such as limits for active maneuvers per user and default filters for item listings.\n- Structuring secure authentication flows, including session locking when minimizing and resuming the app.\n- Active participation in design, architecture, and feature prioritization decisions, helping align technical direction and user experience.",
      "links": [
        {
          "name": "Repository",
          "url": "https://github.com/RodrigoDGoulart/field-crew-manager"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/ionic-deploy-manager-thumbnail.png"
      ],
      "title": "Deploy Manager - IONIC",
      "subtitle": "FATEC - Academic Project [2023]",
      "badges": [
        "react",
        "typescript",
        "node",
        "mysql",
        "sass",
        "docker"
      ],
      "desc": "<b>Deploy Manager</b> (also referenced in the repository as <b>IONIC Deploy Manager</b>) is a web application developed through an academic partnership with <b>IONIC Health</b> during the Systems Analysis and Development program at FATEC, with the purpose of <b>organizing and managing the company’s internal ticket workflow</b>. The solution was designed to structure ticket creation, request evaluation, and progress tracking for implementation tasks or bug fixes, centered around a clear and efficient user experience. The application was built using a modern stack with <b>React and TypeScript on the front-end</b> and <b>Node.js with TypeScript on the back-end</b>, supported by an agile SCRUM-based development process with iterative sprint deliveries throughout the project lifecycle.",
      "details": "My role in the project included serving as <b>Scrum Master</b>, as well as leading the development of the <b>front-end and interface prototyping</b>, while actively supporting sprint planning and project management. I worked directly on defining user flows, organizing the backlog, prioritizing deliveries, and implementing core features required for the final solution. This experience strengthened my technical leadership and team coordination skills, while also reinforcing my proximity to full-stack development within an integrated, real project context.\nMain contributions to the project:\n- Sprint organization and facilitation as Scrum Master, including story definition, delivery planning, and presenting results to stakeholders and the academic board.\n- Interface prototyping and front-end development using React + TypeScript, with a focus on usability and performance.\n- Implementation of ticket creation and management screens, status filters, activity details, and tracking dashboards.\n- Integration with the Node.js + TypeScript backend to consume APIs for ticket creation, updates, and queries.\n- Participation in design, architecture, and technical prioritization decisions, aligning client expectations with planned deliveries.\n- Support during deployment processes and ensuring consistency between prototypes and the final product.",
      "links": [
        {
          "name": "Repository",
          "url": "https://github.com/meta-build/Projeto-IONIC-Health"
        }
      ]
    },
    {
      "imgs": [
        "images/project_imgs/embraer-old-thumbnail.png"
      ],
      "title": "Operational Landing Distance - EMBRAER",
      "subtitle": "FATEC - Academic Project [2022]",
      "badges": [
        "react",
        "typescript",
        "node",
        "mysql",
        "bootstrap",
        "figma"
      ],
      "desc": "<b>Operational Landing Distance</b> is an application developed through an academic partnership with <b>EMBRAER</b> during the Systems Analysis and Development program at FATEC, with the goal of building an aircraft landing distance calculator. The solution accounts for multiple operational variables, including <b>airport environmental conditions, meteorological factors, and aircraft characteristics</b> such as model, size, and specific configurations—enabling simulations of real scenarios used in aeronautical planning. <b>The project was completed in the second semester of the program as part of a hands-on initiative focused on real industry problems</b>, bringing students closer to technical challenges found in the aviation sector.",
      "details": "My role in the project focused on the <b>end-to-end development of the application interfaces, from initial concept and prototyping through the final production implementation</b>. The project played a key role in my technical growth, representing my first practical experience with SPA architectures, interface componentization, and the adoption of user experience (UX) best practices, while also strengthening my ability to deliver within agile cycles.\nMain contributions to the project:\n- Ideation and prototyping of screens and navigation flows, ensuring clarity, usability, and well-structured information.\n- Development of the final interfaces in the production environment, ensuring visual consistency and a strong user experience.\n- First hands-on experience with SPA architecture and component-based UI development, applying modern front-end concepts.\n- Continuous improvement of interface and UX practices throughout the project sprints.\n- Active participation across all four development sprints, contributing directly to planned deliveries.\n- Recognition as one of the standout developers on the team, helping organize tasks and sustain the team’s delivery pace.",
      "links": [
        {
          "name": "Repository",
          "url": "https://github.com/meta-build/Projeto-Embraer"
        }
      ]
    }
  ]
}